titanic datasını okuyunuz(<b>train.csv</b>). Ödevin geri kalanında dataframe gösterimlerini <b>display()</b> fonksiyonunu kullanarak yapınız.<br> Örn: display(titanic_df)

In [220]:
import numpy as np
import pandas as pd

In [221]:
df_titanic = pd.read_csv("train.csv")

In [222]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [223]:
df_titanic.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [224]:
df_titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [225]:
display(df_titanic)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Soru 1:

Kazada ölenlerin yaş ortalamasını bulunuz

In [226]:
df_titanic.query("Survived == 0").Age.mean()

30.62617924528302

Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [227]:
df_titanic.query("Survived == 0").Fare.mean(), df_titanic.query("Survived==0").Fare.median()

(22.117886885245877, 10.5)

Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [228]:
df_titanic.query("Survived == 0 and Sex=='male'").Age.mean()

31.618055555555557

Kazada ölen Kadınların yaş ortalamasını bulunuz

In [229]:
df_titanic.query("Survived == 0 and Sex == 'female'").Age.mean()

25.046875

# Soru 2:

Kazadan kurtulanların yaş ortalamasını bulunuz

In [230]:
df_titanic.query("Survived == 1").Age.mean()

28.343689655172415

Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [231]:
df_titanic.query("Survived==1").Fare.mean()

48.39540760233917

Kazadan kurtulan toplam kişi sayısını bulunuz

In [232]:
kurtulan_sayisi = df_titanic.query("Survived ==1")
len(kurtulan_sayisi)

342

Kazadan kurtulan erkeklerin yaş ortalamasını bulunuz

In [233]:
df_titanic.query("Survived == 1 and Sex=='male'").Age.mean()

27.276021505376345

Kazadan kurtulan kadınların yaş ortalamasını bulunuz

In [234]:
df_titanic.query("Survived == 1 and Sex=='female'").Age.mean()

28.84771573604061

# Soru 3:

10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [235]:
df_titanic.query("Age<10").Fare.median()

27.0

10 yaşından büyüklerin bilet fiyatlarının medyan değerini bulunuz

In [236]:
df_titanic.query("Age>10").Fare.median()

13.92915

# Soru 5:

1.sınıf, 2.sınıf ve 3.sınıf yolcuların ölüm oranlarını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [237]:
display(df_titanic)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [238]:
olum1 = df_titanic.query("Pclass ==1 and Survived==0")
toplam1 = df_titanic.query("Pclass==1")
olum2 = df_titanic.query("Pclass ==2 and Survived==0")
toplam2 = df_titanic.query("Pclass==2")
olum3 = df_titanic.query("Pclass ==3 and Survived==0")
toplam3 = df_titanic.query("Pclass==3")

In [239]:
print("1. sınıftaki yolcuların ölüm oranı :", len(olum1)/len(toplam1))
print("2. sınıftaki yolcuların ölüm oranı :", len(olum2)/len(toplam2))
print("3. sınıftaki yolcuların ölüm oranı :", len(olum3)/len(toplam3))

1. sınıftaki yolcuların ölüm oranı : 0.37037037037037035
2. sınıftaki yolcuların ölüm oranı : 0.5271739130434783
3. sınıftaki yolcuların ölüm oranı : 0.7576374745417516

In [240]:
print("3. sınıf yolcularda ölüm oranı en yüksektir.En az ölüm oranı ise 1. sınıf yolcularda görülmektedir bunun yanında 2. sınıf yolcular ise ortalama bir ölüm oranına sahiptir.")

3. sınıf yolcularda ölüm oranı en yüksektir.En az ölüm oranı ise 1. sınıf yolcularda görülmektedir bunun yanında 2. sınıf yolcular ise ortalama bir ölüm oranına sahiptir.

1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarını karşılaştırınız

In [241]:
df_titanic.query("Pclass == 1").Fare.mean(), df_titanic.query("Pclass == 2").Fare.mean(),df_titanic.query("Pclass == 3").Fare.mean()

(84.15468749999992, 20.66218315217391, 13.675550101832997)

In [242]:
print("1. sınıf yolcuların bilet fiyatları en yüksektir, 2. sınıf yolcuların bilet fiyatları ikinci sırada iken 3. sınıf yolcuların bilet fiyatları en düşüktür.")

1. sınıf yolcuların bilet fiyatları en yüksektir, 2. sınıf yolcuların bilet fiyatları ikinci sırada iken 3. sınıf yolcuların bilet fiyatları en düşüktür.

# Soru 6:

Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [243]:
print("ölen kadin oranı:", len(df_titanic.query("Survived==0 and Sex=='female'"))/len(df_titanic.query("Sex=='female'")))
print("ölen erkek oranı:", len(df_titanic.query("Survived==0 and Sex=='male'"))/len(df_titanic.query("Sex=='male'")))

ölen kadin oranı: 0.25796178343949044
ölen erkek oranı: 0.8110918544194108

In [244]:
print("Kazada ölen kadın oranı; ölen erkek oranının yaklaşık üçte biridir.")

Kazada ölen kadın oranı; ölen erkek oranının yaklaşık üçte biridir.

# Soru 7:

Kazada ölen erkeklerin ortalama bilet fiyatı ile kurtulan erkeklerin ortalama bilet fiyatını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [245]:
print("Ölen erkeklerin bilet fiyatı ortalaması:", df_titanic.query("Sex=='male' and Survived==0").Fare.mean())
print("Kurtulan erkeklerin bilet fiyatı ortalaması:", df_titanic.query("Sex=='male' and Survived==1").Fare.mean())

Ölen erkeklerin bilet fiyatı ortalaması: 21.960992948717944
Kurtulan erkeklerin bilet fiyatı ortalaması: 40.82148440366974

In [246]:
print("Kazadan kurtulan erkeklerin ödediği bilet fiyatları ölenlerinkinin neredeyse 2 katı olmasına rağmen bu onların hayatta kalmasına sebep olmuş olabilir.")

Kazadan kurtulan erkeklerin ödediği bilet fiyatları ölenlerinkinin neredeyse 2 katı olmasına rağmen bu onların hayatta kalmasına sebep olmuş olabilir.

# Missing Value Doldurma

Bundan sonraki soruları <b>train_missing.csv</b> datasını kullanarak cevaplayınız.

In [247]:
df_missing_titanic = pd.read_csv("train_missing.csv")

In [248]:
display(df_missing_titanic)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

In [249]:
df_missing_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          721 non-null float64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           800 non-null float64
Cabin          204 non-null object
Embarked       718 non-null object
dtypes: float64(3), int64(4), object(5)
memory usage: 83.7+ KB

In [250]:
df_missing_titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp          170
Parch            0
Ticket           0
Fare            91
Cabin          687
Embarked       173
dtype: int64

# Soru 8

Age, Embarked ve Fare değişkenlerini mean/median/mode değerlerini kullanarak değişken tipine uygun olacak şekilde doldurunuz.

In [251]:
df_missing_titanic.iloc[:,[5,9,11]]

      Age     Fare Embarked
0    22.0   7.2500        S
1    38.0  71.2833        C
2    26.0   7.9250      NaN
3    35.0  53.1000        S
4    35.0   8.0500      NaN
..    ...      ...      ...
886  27.0  13.0000        S
887  19.0  30.0000        S
888   NaN      NaN        S
889  26.0  30.0000      NaN
890  32.0   7.7500        Q

[891 rows x 3 columns]

In [252]:
df_missing_titanic.Age.median()

28.0

In [253]:
df_missing_titanic.Age = df_missing_titanic.Age.fillna(df_missing_titanic.Age.median())

In [254]:
df_missing_titanic.Age.isnull().sum()

0

In [255]:
df_missing_titanic.Fare.mean()

31.844821874999965

In [256]:
df_missing_titanic.Fare = df_missing_titanic.Fare.fillna(df_missing_titanic.Fare.mean())

In [257]:
df_missing_titanic.Fare.isnull().sum()

0

In [258]:
df_missing_titanic.Embarked.value_counts()

S    529
C    128
Q     61
Name: Embarked, dtype: int64

In [259]:
df_missing_titanic.Embarked = df_missing_titanic.Embarked.fillna(df_missing_titanic.Embarked.mode()[0])

In [260]:
df_missing_titanic.Embarked.isnull().sum()

0

In [261]:
df_missing_titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp          170
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

# Soru 9

SibSp değişkeni hangi yöntemler ile doldurulabilir, fikir yürütün. Uygun bir yöntem ile doldurun. (SibSp değişkeni kişilerin gemide bulunan kardeş/eş sayısını belirtiyor.)

In [262]:
df_missing_titanic.SibSp.head()

0    1.0
1    1.0
2    0.0
3    1.0
4    0.0
Name: SibSp, dtype: float64

In [263]:
df_missing_titanic.SibSp.value_counts()

0.0    489
1.0    173
2.0     21
4.0     16
3.0     12
8.0      7
5.0      3
Name: SibSp, dtype: int64

In [264]:
df_missing_titanic.SibSp.median()

0.0

In [265]:
df_missing_titanic.SibSp.mode()

0    0.0
dtype: float64

In [266]:
df_missing_titanic.SibSp.describe()

count    721.000000
mean       0.535368
std        1.140996
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        8.000000
Name: SibSp, dtype: float64

### SibSp kolonunun Age ve Sex gibi kişisel durumların yanı sıra Embarked gibi çevresel ve Fare gibi ekonomik durumlar tarafından etkilenebileceği tahmin edilebilir. Bu sebeple KNN algoritması ile eksik verileri doldurup bu özelliklere de gerekli ağırlıkları atayabileceğimizi düşünüyorum.

In [267]:
from sklearn.neighbors import KNeighborsClassifier

In [268]:
df_missing_titanic_2 = df_missing_titanic.copy()

In [269]:
df_missing_titanic_2.set_index("PassengerId", inplace = True)

In [270]:
for col in ["Sex", "Ticket","Cabin","Embarked"]:
    df_missing_titanic_2[col] = df_missing_titanic_2[col].astype('category')
    df_missing_titanic_2[col] = df_missing_titanic_2[col].cat.codes

In [271]:
df_missing_titanic_2_complete = df_missing_titanic_2.dropna()

In [272]:
df_missing_titanic_2_complete

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",1,22.0,1.0,0,523,7.250000,-1,2
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1.0,0,596,71.283300,81,0
3,1,3,"Heikkinen, Miss. Laina",0,26.0,0.0,0,669,7.925000,-1,2
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1.0,0,49,53.100000,55,2
5,0,3,"Allen, Mr. William Henry",1,35.0,0.0,0,472,8.050000,-1,2
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",1,27.0,0.0,0,101,13.000000,-1,2
888,1,1,"Graham, Miss. Margaret Edith",0,19.0,0.0,0,14,30.000000,30,2
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,28.0,1.0,2,675,31.844822,-1,2
890,1,1,"Behr, Mr. Karl Howell",1,26.0,0.0,0,8,30.000000,60,2
891,0,3,"Dooley, Mr. Patrick",1,32.0,0.0,0,466,7.750000,-1,1

In [273]:
knn = KNeighborsClassifier(n_neighbors = 3, weights="distance")

In [274]:
X = df_missing_titanic_2_complete[df_missing_titanic_2_complete.columns.difference(["SibSp","Name","Survived"])]
Y = df_missing_titanic_2_complete.SibSp
print(X)
print(Y)

              Age  Cabin  Embarked       Fare  Parch  Pclass  Sex  Ticket
PassengerId
1            22.0     -1         2   7.250000      0       3    1     523
2            38.0     81         0  71.283300      0       1    0     596
3            26.0     -1         2   7.925000      0       3    0     669
4            35.0     55         2  53.100000      0       1    0      49
5            35.0     -1         2   8.050000      0       3    1     472
...           ...    ...       ...        ...    ...     ...  ...     ...
887          27.0     -1         2  13.000000      0       2    1     101
888          19.0     30         2  30.000000      0       1    0      14
889          28.0     -1         2  31.844822      2       3    0     675
890          26.0     60         2  30.000000      0       1    1       8
891          32.0     -1         1   7.750000      0       3    1     466

[721 rows x 8 columns]
PassengerId
1      1.0
2      1.0
3      0.0
4      1.0
5      0.0
      ...
887    0.0
888    0.0
889    1.0
890    0.0
891    0.0
Name: SibSp, Length: 721, dtype: float64

In [275]:
model = knn.fit(X,Y)

In [276]:
na_indices = df_missing_titanic_2.index.difference(df_missing_titanic_2_complete.index)
na_indices

Int64Index([  8,   9,  15,  23,  31,  37,  38,  42,  45,  47,
            ...
            828, 841, 842, 850, 851, 855, 863, 879, 880, 882],
           dtype='int64', name='PassengerId', length=170)

In [277]:
X_missing = df_missing_titanic_2.loc[na_indices][["Cabin","Embarked","Fare","Parch","Pclass","Sex","Age","Ticket"]]

In [278]:
X_missing.head()

             Cabin  Embarked     Fare  Parch  Pclass  Sex   Age  Ticket
PassengerId
8               -1         2  21.0750      1       3    1   2.0     395
9               -1         2  11.1333      2       3    0  27.0     344
15              -1         2   7.8542      0       3    0  14.0     413
23              -1         1   8.0292      0       3    0  15.0     278
31              -1         0  27.7208      0       1    1  40.0     598

In [279]:
imputed_SibSp = model.predict(X_missing)
imputed_SibSp

array([0., 1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 1.,
       0., 1., 0., 0., 0., 1., 0., 0., 0., 1., 0., 0., 0., 1., 1., 0., 0.,
       0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0.,
       0., 0., 0., 1., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 1., 1.,
       0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 1.,
       1., 0., 0., 1., 0., 0., 0., 1., 0., 0., 0., 0., 1., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 1., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0.,
       1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 1., 0., 0.])

In [280]:
na_indices

Int64Index([  8,   9,  15,  23,  31,  37,  38,  42,  45,  47,
            ...
            828, 841, 842, 850, 851, 855, 863, 879, 880, 882],
           dtype='int64', name='PassengerId', length=170)

In [281]:
df_missing_titanic_2.loc[na_indices, "SibSp"] = imputed_SibSp

In [282]:
df_missing_titanic_2.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",1,22.0,1.0,0,523,7.2500,-1,2
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1.0,0,596,71.2833,81,0
3,1,3,"Heikkinen, Miss. Laina",0,26.0,0.0,0,669,7.9250,-1,2
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1.0,0,49,53.1000,55,2
5,0,3,"Allen, Mr. William Henry",1,35.0,0.0,0,472,8.0500,-1,2

In [283]:
df_missing_titanic_2.SibSp.describe()

count    891.000000
mean       0.464646
std        1.049150
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        8.000000
Name: SibSp, dtype: float64

In [284]:
df_missing_titanic.SibSp.describe()

count    721.000000
mean       0.535368
std        1.140996
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        8.000000
Name: SibSp, dtype: float64

# Soru 10

Datayı baştan okuyun. Embarked değişkenini "NAN" şeklinde yeni bir kategorisi olacak şekilde doldurun.

In [285]:
df_missing_titanic_3 = pd.read_csv("train_missing.csv")

In [286]:
df_missing_titanic_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          721 non-null float64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           800 non-null float64
Cabin          204 non-null object
Embarked       718 non-null object
dtypes: float64(3), int64(4), object(5)
memory usage: 83.7+ KB

In [287]:
display(df_missing_titanic_3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

In [288]:
df_missing_titanic_3.insert(12,"Embarked_NAN",1)

In [289]:
df_missing_titanic_3.loc[df_missing_titanic_3.Embarked[df_missing_titanic_3.Embarked.isnull()].index.to_list(),"Embarked_NAN"] = 0

In [290]:
display(df_missing_titanic_3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Embarked_NAN
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q,1

# Soru 11

"Fare" değişkeni için "Fare_Missing" adında yeni bir değişken türetip "Fare" değişkenini median ile doldurun.

In [291]:
df_missing_titanic_3.isnull().sum()

PassengerId       0
Survived          0
Pclass            0
Name              0
Sex               0
Age             177
SibSp           170
Parch             0
Ticket            0
Fare             91
Cabin           687
Embarked        173
Embarked_NAN      0
dtype: int64

In [292]:
na_indices = df_missing_titanic_3[df_missing_titanic_3["Fare"].isnull()].index
na_indices

Int64Index([ 11,  12,  17,  35,  40,  45,  67,  69,  70,  97, 105, 113, 129,
            162, 166, 175, 181, 182, 193, 206, 210, 215, 229, 255, 264, 267,
            283, 296, 301, 308, 324, 332, 354, 390, 396, 404, 413, 417, 427,
            430, 436, 437, 438, 440, 443, 456, 463, 490, 494, 504, 533, 562,
            589, 596, 599, 608, 614, 617, 618, 627, 654, 659, 676, 679, 681,
            684, 690, 695, 721, 722, 729, 748, 752, 757, 763, 773, 781, 783,
            790, 794, 798, 806, 808, 822, 823, 825, 841, 863, 872, 885, 888],
           dtype='int64')

In [293]:
df_missing_titanic_3.Fare.fillna(value = df_missing_titanic_3.Fare.median(), inplace = True)

In [294]:
df_missing_titanic_3.insert(10,"Fare_Misssing", value =0)

In [295]:
display(df_missing_titanic_3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Fare_Misssing,Cabin,Embarked,Embarked_NAN
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.25000,0,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.28330,0,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.92500,0,NaN,NaN,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.10000,0,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.05000,0,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.00000,0,NaN,S,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.00000,0,B42,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,14.45625,0,NaN,S,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.00000,0,C148,NaN,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.75000,0,NaN,Q,1